clear;
clc;
close all;

%% 1. Исходные данные
D = 0.25;
R = D / 2;
vx = 1.5;
Rx = 60;
rho = 1000;

%% 2. Расчет гребного винта
phi_alpha = 0;
t = 0.1;
vp = vx;

% 1) Требуемый упор:
T_req = Rx/(1-t); 

% 2) k_d'
k_d = D*vp*sqrt(rho/T_req);

% 3) Параметры винта
K1 = 0.18;
lambda = 0.66;
HD = 1;
K2 = 0.032;
fprintf('K1 = %.2f\n', K1);
fprintf('K2 = %.3f\n', K2);

% 4) Угловая скорость вращения
n = vp/(lambda*D);
fprintf('Угловая скорость винта n = %.2f рад/с \n', n);

% 5) Уточненный упор
T_actual = K1 * rho * n^2 * D^4;
fprintf('Фактический упор винта = %.2f Н\n', T_actual);

% 6) Момент сопротивления гребного винта
M_prop = K2 * rho * n^2 * D^5;
fprintf('Момент сопротивления винта M_prop = %.2f Н*м\n', M_prop);

N = 2*3.14*n*M_prop;
fprintf('Мощность N = %.1f Вт\n', N);

% 7) Момент инерции гребного винта
rho_v = 7700;
h = 0.004;
J_prop = rho_v * pi * R^4 * h / 2; 
fprintf('Момент инерции винта J_prop = %.3f кг*м^2\n', J_prop);

%% 3. Выбор электродвигателя и расчет редуктора
% Выбираем двигатель 136210
n_motor = 8380;
M_motor = 0.285;
L = 0.0565 / 1000;
R_m = 0.143;
km = 25 / 1000;
J = 209 / (10^6);
kw = 1 / 382;

% Коэффициент передачи редуктора
i = n_motor/(n*60);
i = round(i);
fprintf('Передаточное число редуктора i = %d \n', i);
